grevaillot/svd_tools/headers/STM32F303/syscfg_comp_opamp.h
#pragma once 

/* --- SYSCFG_COMP_OPAMP: System configuration controller _Comparator and Operational amplifier  */

/** @defgroup syscfg_comp_opamp_registers System configuration controller _Comparator and
      Operational amplifier Register
@{*/

/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1 configuration register 1 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x00)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR CCM SRAM protection register **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x04)
/** SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1 external interrupt configuration register 1 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x08)
/** SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2 external interrupt configuration register 2 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x0c)
/** SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3 external interrupt configuration register 3 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x10)
/** SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4 external interrupt configuration register 4 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x14)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2 configuration register 2 **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x18)
/** SYSCFG_COMP_OPAMP_COMP1_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x1c)
/** SYSCFG_COMP_OPAMP_COMP2_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x20)
/** SYSCFG_COMP_OPAMP_COMP3_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x24)
/** SYSCFG_COMP_OPAMP_COMP4_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x28)
/** SYSCFG_COMP_OPAMP_COMP5_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x2c)
/** SYSCFG_COMP_OPAMP_COMP6_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x30)
/** SYSCFG_COMP_OPAMP_COMP7_CSR control and status register **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x34)
/** SYSCFG_COMP_OPAMP_OPAMP1_CSR control register **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x38)
/** SYSCFG_COMP_OPAMP_OPAMP2_CSR control register **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x3c)
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR control register **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x40)
/** SYSCFG_COMP_OPAMP_OPAMP4_CSR control register **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR			MMIO32(SYSCFG_COMP_OPAMP_BASE + 0x44)

/**@}*/


/** @defgroup syscfg_comp_opamp_syscfg_cfgr1 SYSCFGCFGR1 configuration register 1
@{*/


#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_FPU_IT_SHIFT		26
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_FPU_IT_MASK		0x3f
/** @defgroup syscfg_comp_opamp_syscfg_cfgr1_fpu_it FPUIT Interrupt enable bits from FPU
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_ENCODER_MODE_SHIFT		22
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_ENCODER_MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_syscfg_cfgr1_encoder_mode ENCODERMODE Encoder mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C2_FM I2C2 Fast Mode Plus **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C2_FM		(1 << 21)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C1_FM I2C1 Fast Mode Plus **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C1_FM		(1 << 20)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB9_FM Fast Mode Plus (FM+) driving capability activation bits. **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB9_FM		(1 << 19)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB8_FM Fast Mode Plus (FM+) driving capability activation bits. **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB8_FM		(1 << 18)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB7_FM Fast Mode Plus (FM+) driving capability activation bits. **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB7_FM		(1 << 17)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB6_FM Fast Mode Plus (FM+) driving capability activation bits. **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_I2C_PB6_FM		(1 << 16)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM7_DAC2_DMA_RMP TIM7 and DAC2 DMA request remapping bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM7_DAC2_DMA_RMP		(1 << 14)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM6_DAC1_DMA_RMP TIM6 and DAC1 DMA request remapping bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM6_DAC1_DMA_RMP		(1 << 13)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM17_DMA_RMP TIM17 DMA request remapping bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM17_DMA_RMP		(1 << 12)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM16_DMA_RMP TIM16 DMA request remapping bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM16_DMA_RMP		(1 << 11)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_ADC24_DMA_RMP ADC24 DMA remapping bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_ADC24_DMA_RMP		(1 << 8)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_DAC_TRIG_RMP DAC trigger remap (when TSEL = 001) **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_DAC_TRIG_RMP		(1 << 7)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM1_ITR_RMP Timer 1 ITR3 selection **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_TIM1_ITR_RMP		(1 << 6)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_USB_IT_RMP USB interrupt remap **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_USB_IT_RMP		(1 << 5)

#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_MEM_MODE_SHIFT		0
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR1_MEM_MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_syscfg_cfgr1_mem_mode MEMMODE Memory mapping selection bits
@{*/
/**@}*/


/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_rcr SYSCFGRCR CCM SRAM protection register
@{*/

/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE7_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE7_WP		(1 << 7)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE6_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE6_WP		(1 << 6)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE5_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE5_WP		(1 << 5)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE4_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE4_WP		(1 << 4)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE3_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE3_WP		(1 << 3)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE2_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE2_WP		(1 << 2)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE1_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE1_WP		(1 << 1)
/** SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE0_WP CCM SRAM page write protection bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_RCR_PAGE0_WP		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_exticr1 SYSCFGEXTICR1 external interrupt configuration register 1
@{*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI3_SHIFT		12
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI3_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr1_exti3 EXTI3 EXTI 3 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI2_SHIFT		8
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI2_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr1_exti2 EXTI2 EXTI 2 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI1_SHIFT		4
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI1_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr1_exti1 EXTI1 EXTI 1 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI0_SHIFT		0
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR1_EXTI0_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr1_exti0 EXTI0 EXTI 0 configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_exticr2 SYSCFGEXTICR2 external interrupt configuration register 2
@{*/


