grevaillot/svd_tools/headers/STM32F303/syscfg_comp_opamp.h
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI7_SHIFT		12
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI7_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr2_exti7 EXTI7 EXTI 7 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI6_SHIFT		8
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI6_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr2_exti6 EXTI6 EXTI 6 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI5_SHIFT		4
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI5_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr2_exti5 EXTI5 EXTI 5 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI4_SHIFT		0
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR2_EXTI4_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr2_exti4 EXTI4 EXTI 4 configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_exticr3 SYSCFGEXTICR3 external interrupt configuration register 3
@{*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI11_SHIFT		12
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI11_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr3_exti11 EXTI11 EXTI 11 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI10_SHIFT		8
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI10_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr3_exti10 EXTI10 EXTI 10 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI9_SHIFT		4
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI9_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr3_exti9 EXTI9 EXTI 9 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI8_SHIFT		0
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR3_EXTI8_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr3_exti8 EXTI8 EXTI 8 configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_exticr4 SYSCFGEXTICR4 external interrupt configuration register 4
@{*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI15_SHIFT		12
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI15_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr4_exti15 EXTI15 EXTI 15 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI14_SHIFT		8
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI14_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr4_exti14 EXTI14 EXTI 14 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI13_SHIFT		4
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI13_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr4_exti13 EXTI13 EXTI 13 configuration bits
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI12_SHIFT		0
#define SYSCFG_COMP_OPAMP_SYSCFG_EXTICR4_EXTI12_MASK		0x0f
/** @defgroup syscfg_comp_opamp_syscfg_exticr4_exti12 EXTI12 EXTI 12 configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup syscfg_comp_opamp_syscfg_cfgr2 SYSCFGCFGR2 configuration register 2
@{*/

/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_SRAM_PEF SRAM parity flag **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_SRAM_PEF		(1 << 8)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_BYP_ADD_PAR Bypass address bit 29 in parity calculation **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_BYP_ADD_PAR		(1 << 4)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_PVD_LOCK PVD lock enable bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_PVD_LOCK		(1 << 2)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_SRAM_PARITY_LOCK SRAM parity lock bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_SRAM_PARITY_LOCK		(1 << 1)
/** SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_LOCUP_LOCK Cortex-M0 LOCKUP bit enable bit **/
#define SYSCFG_COMP_OPAMP_SYSCFG_CFGR2_LOCUP_LOCK		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp1_csr COMP1CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1LOCK Comparator 1 lock **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1OUT Comparator 1 output **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp1_csr_comp1_blanking COMP1BLANKING Comparator 1 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp1_csr_comp1hyst COMP1HYST Comparator 1 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1POL Comparator 1 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp1_csr_comp1_out_sel COMP1OUTSEL Comparator 1 output selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp1_csr_comp1insel COMP1INSEL Comparator 1 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp1_csr_comp1mode COMP1MODE Comparator 1 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_INP_DAC COMP1_INP_DAC **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1_INP_DAC		(1 << 1)
/** SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1EN Comparator 1 enable **/
#define SYSCFG_COMP_OPAMP_COMP1_CSR_COMP1EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp2_csr COMP2CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2LOCK Comparator 2 lock **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2LOCK		(1 << 31)

#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp2_csr_comp2_blanking COMP2BLANKING Comparator 2 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp2_csr_comp2hyst COMP2HYST Comparator 2 hysteresis
@{*/
/**@}*/

