grevaillot/svd_tools/headers/STM32F303/syscfg_comp_opamp.h
/** SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2POL Comparator 2 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp2_csr_comp2_out_sel COMP2OUTSEL Comparator 2 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INMSEL Comparator 1inverting input selection **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INMSEL		(1 << 9)
/** SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INPSEL Comparator 2 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp2_csr_comp2insel COMP2INSEL Comparator 2 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp2_csr_comp2mode COMP2MODE Comparator 2 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2EN Comparator 2 enable **/
#define SYSCFG_COMP_OPAMP_COMP2_CSR_COMP2EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp3_csr COMP3CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3LOCK Comparator 3 lock **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3OUT Comparator 3 output **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp3_csr_comp3_blanking COMP3BLANKING Comparator 3 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp3_csr_comp3hyst COMP3HYST Comparator 3 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3POL Comparator 3 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp3_csr_comp3_out_sel COMP3OUTSEL Comparator 3 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3INPSEL Comparator 3 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp3_csr_comp3insel COMP3INSEL Comparator 3 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp3_csr_comp3mode COMP3MODE Comparator 3 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3EN Comparator 3 enable **/
#define SYSCFG_COMP_OPAMP_COMP3_CSR_COMP3EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp4_csr COMP4CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4LOCK Comparator 4 lock **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4OUT Comparator 4 output **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp4_csr_comp4_blanking COMP4BLANKING Comparator 4 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp4_csr_comp4hyst COMP4HYST Comparator 4 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4POL Comparator 4 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp4_csr_comp4_out_sel COMP4OUTSEL Comparator 4 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP4_CSR_COM4WINMODE Comparator 4 window mode **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COM4WINMODE		(1 << 9)
/** SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4INPSEL Comparator 4 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp4_csr_comp4insel COMP4INSEL Comparator 4 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp4_csr_comp4mode COMP4MODE Comparator 4 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4EN Comparator 4 enable **/
#define SYSCFG_COMP_OPAMP_COMP4_CSR_COMP4EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp5_csr COMP5CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5LOCK Comparator 5 lock **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5OUT Comparator51 output **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp5_csr_comp5_blanking COMP5BLANKING Comparator 5 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp5_csr_comp5hyst COMP5HYST Comparator 5 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5POL Comparator 5 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp5_csr_comp5_out_sel COMP5OUTSEL Comparator 5 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5INPSEL Comparator 5 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp5_csr_comp5insel COMP5INSEL Comparator 5 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp5_csr_comp5mode COMP5MODE Comparator 5 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5EN Comparator 5 enable **/
#define SYSCFG_COMP_OPAMP_COMP5_CSR_COMP5EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp6_csr COMP6CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6LOCK Comparator 6 lock **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6OUT Comparator 6 output **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp6_csr_comp6_blanking COMP6BLANKING Comparator 6 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp6_csr_comp6hyst COMP6HYST Comparator 6 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6POL Comparator 6 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp6_csr_comp6_out_sel COMP6OUTSEL Comparator 6 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP6_CSR_COM6WINMODE Comparator 6 window mode **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COM6WINMODE		(1 << 9)
/** SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6INPSEL Comparator 6 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp6_csr_comp6insel COMP6INSEL Comparator 6 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp6_csr_comp6mode COMP6MODE Comparator 6 mode
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6EN Comparator 6 enable **/
#define SYSCFG_COMP_OPAMP_COMP6_CSR_COMP6EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_comp7_csr COMP7CSR control and status register
@{*/

/** SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7LOCK Comparator 7 lock **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7OUT Comparator 7 output **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7OUT		(1 << 30)

#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7_BLANKING_SHIFT		18
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7_BLANKING_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp7_csr_comp7_blanking COMP7BLANKING Comparator 7 blanking source
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7HYST_SHIFT		16
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7HYST_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp7_csr_comp7hyst COMP7HYST Comparator 7 hysteresis
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7POL Comparator 7 output polarity **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7POL		(1 << 15)

#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7_OUT_SEL_SHIFT		10
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7_OUT_SEL_MASK		0x0f
/** @defgroup syscfg_comp_opamp_comp7_csr_comp7_out_sel COMP7OUTSEL Comparator 7 output selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7INPSEL Comparator 7 non inverted input selection **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7INPSEL		(1 << 7)

#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7INSEL_SHIFT		4
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7INSEL_MASK		0x07
/** @defgroup syscfg_comp_opamp_comp7_csr_comp7insel COMP7INSEL Comparator 7 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7MODE_SHIFT		2
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7MODE_MASK		0x03
/** @defgroup syscfg_comp_opamp_comp7_csr_comp7mode COMP7MODE Comparator 7 mode
@{*/
/**@}*/

