grevaillot/svd_tools/headers/STM32F303/syscfg_comp_opamp.h
/** SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7EN Comparator 7 enable **/
#define SYSCFG_COMP_OPAMP_COMP7_CSR_COMP7EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_opamp1_csr OPAMP1CSR control register
@{*/

/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_LOCK OPAMP 1 lock **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_OUTCAL OPAMP 1 ouput status flag **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_OUTCAL		(1 << 30)
/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_TSTREF TSTREF **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TSTREF		(1 << 29)

#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TRIMOFFSETN_SHIFT		24
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TRIMOFFSETN_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp1_csr_trimoffsetn TRIMOFFSETN Offset trimming value (NMOS)
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TRIMOFFSETP_SHIFT		19
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TRIMOFFSETP_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp1_csr_trimoffsetp TRIMOFFSETP Offset trimming value (PMOS)
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_USER_TRIM User trimming enable **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_USER_TRIM		(1 << 18)

#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_PGA_GAIN_SHIFT		14
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_PGA_GAIN_MASK		0x0f
/** @defgroup syscfg_comp_opamp_opamp1_csr_pga_gain PGAGAIN Gain in PGA mode
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_CALSEL_SHIFT		12
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_CALSEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp1_csr_calsel CALSEL Calibration selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_CALON Calibration mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_CALON		(1 << 11)

#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VPS_SEL_SHIFT		9
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VPS_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp1_csr_vps_sel VPSSEL OPAMP1 Non inverting input secondary selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_VMS_SEL OPAMP1 inverting input secondary selection **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VMS_SEL		(1 << 8)
/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_TCM_EN Timer controlled Mux mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_TCM_EN		(1 << 7)

#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VM_SEL_SHIFT		5
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VM_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp1_csr_vm_sel VMSEL OPAMP1 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VP_SEL_SHIFT		2
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_VP_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp1_csr_vp_sel VPSEL OPAMP1 Non inverting input selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_FORCE_VP FORCE_VP **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_FORCE_VP		(1 << 1)
/** SYSCFG_COMP_OPAMP_OPAMP1_CSR_OPAMP1_EN OPAMP1 enable **/
#define SYSCFG_COMP_OPAMP_OPAMP1_CSR_OPAMP1_EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_opamp2_csr OPAMP2CSR control register
@{*/

/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_LOCK OPAMP 2 lock **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_OUTCAL OPAMP 2 ouput status flag **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_OUTCAL		(1 << 30)
/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_TSTREF TSTREF **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TSTREF		(1 << 29)

#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TRIMOFFSETN_SHIFT		24
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TRIMOFFSETN_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp2_csr_trimoffsetn TRIMOFFSETN Offset trimming value (NMOS)
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TRIMOFFSETP_SHIFT		19
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TRIMOFFSETP_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp2_csr_trimoffsetp TRIMOFFSETP Offset trimming value (PMOS)
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_USER_TRIM User trimming enable **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_USER_TRIM		(1 << 18)

#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_PGA_GAIN_SHIFT		14
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_PGA_GAIN_MASK		0x0f
/** @defgroup syscfg_comp_opamp_opamp2_csr_pga_gain PGAGAIN Gain in PGA mode
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_CAL_SEL_SHIFT		12
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_CAL_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp2_csr_cal_sel CALSEL Calibration selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_CALON Calibration mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_CALON		(1 << 11)

#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VPS_SEL_SHIFT		9
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VPS_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp2_csr_vps_sel VPSSEL OPAMP2 Non inverting input secondary selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_VMS_SEL OPAMP2 inverting input secondary selection **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VMS_SEL		(1 << 8)
/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_TCM_EN Timer controlled Mux mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_TCM_EN		(1 << 7)

#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VM_SEL_SHIFT		5
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VM_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp2_csr_vm_sel VMSEL OPAMP2 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VP_SEL_SHIFT		2
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_VP_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp2_csr_vp_sel VPSEL OPAMP2 Non inverting input selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_FORCE_VP FORCE_VP **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_FORCE_VP		(1 << 1)
/** SYSCFG_COMP_OPAMP_OPAMP2_CSR_OPAMP2EN OPAMP2 enable **/
#define SYSCFG_COMP_OPAMP_OPAMP2_CSR_OPAMP2EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_opamp3_csr OPAMP3CSR control register
@{*/

/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_LOCK OPAMP 3 lock **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_OUTCAL OPAMP 3 ouput status flag **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_OUTCAL		(1 << 30)
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_TSTREF TSTREF **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TSTREF		(1 << 29)

#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TRIMOFFSETN_SHIFT		24
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TRIMOFFSETN_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp3_csr_trimoffsetn TRIMOFFSETN Offset trimming value (NMOS)
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TRIMOFFSETP_SHIFT		19
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TRIMOFFSETP_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp3_csr_trimoffsetp TRIMOFFSETP Offset trimming value (PMOS)
@{*/
/**@}*/

