grevaillot/svd_tools/headers/STM32F303/syscfg_comp_opamp.h
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_USER_TRIM User trimming enable **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_USER_TRIM		(1 << 18)

#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_PGA_GAIN_SHIFT		14
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_PGA_GAIN_MASK		0x0f
/** @defgroup syscfg_comp_opamp_opamp3_csr_pga_gain PGAGAIN Gain in PGA mode
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_CALSEL_SHIFT		12
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_CALSEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp3_csr_calsel CALSEL Calibration selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_CALON Calibration mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_CALON		(1 << 11)

#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VPS_SEL_SHIFT		9
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VPS_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp3_csr_vps_sel VPSSEL OPAMP3 Non inverting input secondary selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_VMS_SEL OPAMP3 inverting input secondary selection **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VMS_SEL		(1 << 8)
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_TCM_EN Timer controlled Mux mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_TCM_EN		(1 << 7)

#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VM_SEL_SHIFT		5
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VM_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp3_csr_vm_sel VMSEL OPAMP3 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VP_SEL_SHIFT		2
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_VP_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp3_csr_vp_sel VPSEL OPAMP3 Non inverting input selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_FORCE_VP FORCE_VP **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_FORCE_VP		(1 << 1)
/** SYSCFG_COMP_OPAMP_OPAMP3_CSR_OPAMP3EN OPAMP3 enable **/
#define SYSCFG_COMP_OPAMP_OPAMP3_CSR_OPAMP3EN		(1 << 0)

/**@}*/

/** @defgroup syscfg_comp_opamp_opamp4_csr OPAMP4CSR control register
@{*/

/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_LOCK OPAMP 4 lock **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_LOCK		(1 << 31)
/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_OUTCAL OPAMP 4 ouput status flag **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_OUTCAL		(1 << 30)
/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_TSTREF TSTREF **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TSTREF		(1 << 29)

#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TRIMOFFSETN_SHIFT		24
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TRIMOFFSETN_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp4_csr_trimoffsetn TRIMOFFSETN Offset trimming value (NMOS)
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TRIMOFFSETP_SHIFT		19
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TRIMOFFSETP_MASK		0x1f
/** @defgroup syscfg_comp_opamp_opamp4_csr_trimoffsetp TRIMOFFSETP Offset trimming value (PMOS)
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_USER_TRIM User trimming enable **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_USER_TRIM		(1 << 18)

#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_PGA_GAIN_SHIFT		14
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_PGA_GAIN_MASK		0x0f
/** @defgroup syscfg_comp_opamp_opamp4_csr_pga_gain PGAGAIN Gain in PGA mode
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_CALSEL_SHIFT		12
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_CALSEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp4_csr_calsel CALSEL Calibration selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_CALON Calibration mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_CALON		(1 << 11)

#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VPS_SEL_SHIFT		9
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VPS_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp4_csr_vps_sel VPSSEL OPAMP4 Non inverting input secondary selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_VMS_SEL OPAMP4 inverting input secondary selection **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VMS_SEL		(1 << 8)
/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_TCM_EN Timer controlled Mux mode enable **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_TCM_EN		(1 << 7)

#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VM_SEL_SHIFT		5
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VM_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp4_csr_vm_sel VMSEL OPAMP4 inverting input selection
@{*/
/**@}*/


#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VP_SEL_SHIFT		2
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_VP_SEL_MASK		0x03
/** @defgroup syscfg_comp_opamp_opamp4_csr_vp_sel VPSEL OPAMP4 Non inverting input selection
@{*/
/**@}*/

/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_FORCE_VP FORCE_VP **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_FORCE_VP		(1 << 1)
/** SYSCFG_COMP_OPAMP_OPAMP4_CSR_OPAMP4EN OPAMP4 enable **/
#define SYSCFG_COMP_OPAMP_OPAMP4_CSR_OPAMP4EN		(1 << 0)

/**@}*/
